var lines = [
	"赵如花：哈哈哈哈哈…真是太优秀了！",
	"你：得了吧，都快折腾死我了。",
	"你：要是早点知道你的真名，还有你居然跟我是一个学校的，也不至于那么晚才发现了。",
	"赵如花：嗯…那你是什么时候发现赵如花就是我的呢？",
	"你：班长给我们看了你们秀恩爱的照片。",
	"赵如花：哈哈哈哈，嫉妒吗？",
	"你：不，谁会嫉妒那个绿帽侠啊…",
	"你：还有那种掐人后颈的手法，显然是精通穴位的人才懂得怎么掐的…",
	"你：虽然从来没有听你提起过，但是…有几次在做的时候，好像莫名其妙就睡着了的感觉…",
	"你：明明处于那种情况下还能睡着，肯定是因为你动了什么手脚吧…",
	"赵如花：嘿嘿嘿，答对了。",
	"赵如花：看你挺累的样子，就让你休息一会儿，不是很好吗？",
	"你：是是是…反正我就是个奴隶而已。",
	"赵如花：知道我有男朋友居然没有生气，反而决定要帮我…",
	"赵如花：最后居然还把自己的老哥送进去了…",
	"赵如花：哈哈哈哈哈哈哈哈哈…不行了，我要笑死了。",
	"赵如花：本来我都没想做到这一步，只是想搞点事情把他吓走而已。",
	"你：唉…那个人，已经游手好闲半年多了，还是关进去比较节约家里的财产…",
	"赵如花：不要说得那么悲惨嘛！你不是已经有了我这个经济来源吗？",
	"你：比起依靠你，我还是好好学习吧。",
	"赵如花：哼，你又不爱我了！",
	"你：我没有，我不敢…",
	"你：说起来，在那之后，我把讲台里的东西一把火全烧了。",
	"你：从此李上天再也没有跟我讲过一句话…",
	"赵如花：哈哈哈哈哈哈哈，你怕是整天被我调教，也成了一个狠人，不错不错…",
	"你：嘛…闲聊就到此为止吧。",
	"你：你终于又回来了，我都快没钱用了…",
	"你：开始吧。",
	"赵如花：嘿嘿嘿，那请吧。",
	"<div class='evidence'>&lt;完&gt;</div>"
];
	
function checkques(){
	switch(i){
	case 29:end();}
	window.scrollTo(0,document.body.scrollHeight);}
	
function checkans(me){
	}

function skip(){
	while(i!=29){
		next();}}