var lines = [
	"也许是经常看推理小说的缘故，又或许是作者偷懒，你一下子就冷静了下来。",
	"胡老师：王最强？！",
	"李上天：…",
	"胡老师跑过去戳了戳倒在地上的王最强。",
	"胡老师：好像只是昏过去了而已。",
	"胡老师：呼，差点以为出现了第二个受害者。",
	"你：老师也调查过班长了吗？",
	"胡老师：对，他已经死了。致命伤在腹部，应该是被人从正面刺杀。",
	"你又望了一眼倒在血泊中的的尸体。",
	"班长脸朝下趴在地上，看不见腹部的伤口和脸上的表情。由于想想就觉得非常血腥，你并不想走过去调查。",
	"胡老师将王最强搬到了教室后面的一排椅子上。",
	"胡老师：今天早上来的时候杨日龙就已经是这样了，我在检查现场之后，发现了讲台上放着一张纸条。",
	"胡老师：于是就从那张纸条开始，一直解谜…",
	"你走过去，看到纸条仍在讲台上，上面写着密码一样的东西。",
	"李上天：你怎么知道这是凶手留下的？",
	"胡老师：就在昨天，我收到一条奇怪的短信，内容莫名其妙，于是就直接删掉了。",
	"胡老师：现在想来，那其实是凶手的预告短信啊！",
	"李上天：哼，可疑。",
	"站在讲台旁的你，此时却注意到了奇怪的地方。",
	"你无意间推开了讲台的滑盖，发现里面整整齐齐地摆放着几个箱子。",
	"你：卧槽！！！",
	"胡老师：嗯？发现什么了？",
	"你：这里面装的都是我以前丢掉或失踪的东西，有很久以前的课本和笔记本什么的…",
	"你：卧槽，连牙刷都有？还有胖次？！",
	"你：是…谁做的啊！",
	"李上天：哦？有趣。",
	"胡老师：嗯…难不成学校里有一个你的痴汉？",
	"胡老师：…",
	"胡老师：等一下，我好像明白了。",
	"胡老师：沉迷解谜和推理，能够迅速破解复杂的记号。",
	"胡老师：对我们班的情况非常了解，并以此出题。",
	"胡老师：而且！拥有自己的秘密据点，将其作为犯罪现场！",
	"你：等一下…你该不会是想说…",
	"胡老师：其实这一切都是你做的吧，我已经完全识破了！",
	"你：（糟了，好像有点不太妙…）",
	"你：…",
	"你：我没有杀班长，也没有出这种谜题。",
	"胡老师：哼，你有什么证据？",
	"你：（有一样东西，是别人都有的，但是只有我买不起。）",
	"你：（没有那个东西，我是不可能做到那件事的…）",
	"你：我又没有手机，怎么可能向老师发送预告短信！",
	"胡老师：！！！",
	"李上天：哈哈哈，精彩。",
	"你：不说手机，我手上没有任何电子设备，在校期间也无法与外界取得联系。",
	"你：所以我是不可能发送那条短信的！",
	"胡老师：哼，也许这是你和某人共同完成的呢？",
	"你：干嘛这么怀疑我啊！我现在才是最懵逼的好吗！",
	"你：说起来老师你才是，刚才…",
	"李上天：你们别吵了，这样互相怀疑就正中凶手下怀了。",
	"李上天：制造模糊的证据，让主角一行人分裂，连环杀人不都是这种套路？",
	"胡老师：但是现在的一切迹象都表明她非常可疑啊，我也只是实话…",
	"李上天：啧，花一上午才解完三题的家伙，干嘛这么得意啊。",
	"胡老师：哼！！！",
	"你：（这家伙…关键时刻还挺可靠的啊。）",
	"你：那也说一下我的想法吧。",
	"你：凶手所设置的谜题中，使用了一种只有我才知道的记号。",
	"胡老师：什么！这么重要的事情，怎么现在才说！",
	"你：说了我不就很可疑了吗…谁想让自己显得可疑啊…",
	"李上天：有意思，那凶手为何会知道这种记号？",
	"你：（如果凶手有那些东西的话，当然就会知道了…）",
	"你在那些箱子里翻找了一会儿，果然找到了写有记号的那本笔记。",
	"你：凶手一定是看过了这本笔记，学会了记号的用法。",
	"胡老师：看吧！我就说是痴汉吧！",
	"你：呃…该说是痴汉吗，应该是个女生才对。",
	"你：因为连牙刷、胖次啥的都…",
	"胡老师：不不不，现在的痴汉很厉害，几乎没有他们办不到的事情！",
	"李上天：你好像还挺懂的啊。",
	"你：那本小说也是，应该就是字面意思，将其作为我的生日礼物…",
	"你：…",
	"你：但是，我从来没有跟人提起过想要这本小说。",
	"你：除了老哥，一次我用室友的手机跟他闲聊时有提到过…",
	"你：…",
	"李上天：所以…你在怀疑你的室友？",
	"李上天：哼，有意思。",
	"李上天：但是这终究也只是一种猜测而已，并没有决定性的证据可以证明。",
	"你：直到谜题解开为止，我也只是在怀疑。",
	"你：但就在刚才，我已经有了决定性的证据。",
	"你：（那个人犯下的巨大失误…）",
	"你：李上天…你是怎么知道老师上午解开的题有三道的？",
	"胡老师：对哦！我记得我只说了一遍，而当时你又不在！",
	"李上天：…",
	"你：…",
	"胡老师：…",
	"你：所以…身为室友，私藏我的东西，学会记号，设计了一系列谜题，并将小说作为礼物送给我的人…",
	"你：就是你吧，李上天？"
];
	
function checkques(){
	switch(i){
	case 39:selitm();break;
	case 59:selitm();break;
	case 77:selitm();break;
	case 84:end();}
	window.scrollTo(0,document.body.scrollHeight);}
	
function checkans(me){
	switch(i){
	case 39:
		if((me.className == "btn 15")||(me.className == "btn 16")){correct();}
		else{alert("没选对哦！");}break;
	case 59:
		if(me.className == "btn 22"){correct();}
		else{alert("没选对哦！");}break;
	case 77:
		if(me.className == "btn 51"){correct();}
		else{alert("没选对哦！");}}}

function skip(){
	while((i!=39)&&(i!=59)&&(i!=77)&&(i!=84)){
		next();}}