var lines = [
	"你：（竟然强行搞出这种封闭环境，看来老师是真想找出幕后黑手啊…）",
	"你：（这么想来，非住校生，很早就来了学校，却一直没有出去的人，不就是…）",
	"你：…",
	"你：对了，我们学校里有个清洁工…",
	"胡老师：啥？清洁工？在这种时候？",
	"仿佛是听见了你的召唤似的，穿着一身清洁工衣服的老哥突然出现在教室门口。",
	"老哥：妹啊！！！",
	"一看到你，老哥就朝你冲了过来，手里的垃圾袋“啪”的一声掉在了地上。",
	"胡老师：出现了！藏在暗中的谜之怪人，真正的幕后黑手！",
	"你：不，这是我哥…",
	"老哥：妹啊，我刚才正准备回去，发现校门锁上了，转了半天也不知道怎么办，呜呜呜…",
	"你：你别哭啊！！！",
	"李上天：呵，今天终于见到了真人，真不愧是有其哥必有其妹啊！",
	"你感觉自己的脸都快被老哥给丢光了。",
	"你：老哥，现在发生了一件严肃的事情，而你是嫌疑人。",
	"老哥：纳尼？！我是嫌疑人？！",
	"老哥颤颤巍巍地转头望了一眼不远处班长的尸体。",
	"你：（老哥之前有对我说过一句话…）",
	"你：（但事实证明，那是在骗我…）",
	"你：老哥，你之前告诉我说垃圾袋里装的是高达模型的零件。",
	"你：如果是这样，为什么掉在地上时没有发出硬物碰撞的声音？",
	"老哥：啊啊啊啊啊！！！",
	"老哥：怎么这样…连你也要背叛我吗，呜呜呜…",
	"离袋子比较近的李上天迅速将袋子解开，取出了里面的东西。",
	"李上天：…",
	"你：…",
	"胡老师：…",
	"那是一套沾血的衣服裤子，血迹已经差不多干掉了，但仍可看出是最近沾上的。",
	"胡老师：哟西，证据确凿，杀人凶手是老哥先生！",
	"老哥：不是我干的啊啊啊！！！以及谁是老哥先生啊！！！",
	"胡老师：少废话，快把U盘交出来！",
	"老哥：？？？",
	"胡老师捉住了瘦弱的老哥，将他全身上下搜了个遍。",
	"胡老师：奇怪，没有U盘…",
	"胡老师：难道是藏到别的地方去了？或者…已经转移到了校外？！",
	"老哥：所以说到底是怎么回事啊！！！",
	"你：老哥，把你知道的都说出来。",
	"老哥：唉，那好吧。",
	"老哥：我被人约了短信，说今天早上来这里开会。",
	"老哥：来了之后，就看到这个人已经倒在地上了，这时突然有人掐住了我的后颈！",
	"老哥：我挣脱那个人，快速逃离了现场，但感觉身体渐渐失去了力气…跑到厕所里面，就支撑不住昏过去了。",
	"老哥：醒来以后发现身上竟然多了这些血迹，没有办法，我只有脱掉衣服，用厕所的垃圾袋装好，然后才…",
	"李上天：等等，你说用的哪里的垃圾袋？",
	"老哥：呃…我也是出于无奈，所以…",
	"你：（难怪从刚才开始就感觉有股味道…）",
	"一瞬间，李上天脸上露出了你从未见过的精彩表情。",
	"老哥：出来以后，我在一间工具间里找到了这套衣服，于是换上准备离开学校。",
	"老哥：之后就遇到了老妹，一起吃了午饭，再之后发现出不去了…",
	"你：（听起来…还挺可信的？）",
	"你：那个约你过来的人是谁？",
	"老哥：是雇主的女儿，身份是这所学校的普通班学生，但从下学期开始会正式辍学。",
	"老哥：名字叫…赵如花。",
	"胡老师：嗯…没有印象。",
	"你：不认识。",
	"李上天：哼，这种普通班的炮灰本大爷毫无兴趣。",
	"胡老师：也就是说，你觉得是那个叫赵如花的学生杀人后嫁祸给你，然后偷了我的U盘？",
	"你：（就那么在意你的U盘啊！）",
	"老哥：对，我是这么想的。",
	"你：（以老哥的性格，确实不可能会违抗雇主女儿的命令…）",
	"你：（这样的话，老哥叫我小心普通班的女生，就能解释得通了。）",
	"胡老师：不，我还是不能相信你！",
	"老哥：诶诶！！！",
	"胡老师：不管怎么想都太奇怪了，跑到厕所就筋疲力尽还昏迷一上午，你是弱鸡吗！",
	"老哥：确实是这样，但是我也觉得很奇怪…一定是被人动了什么手脚…",
	"你：（不论事实是怎样，这都无从考证了吧…）",
	"你：暂且相信老哥的话吧。",
	"你：比起这个，老师的U盘不是还下落不明么？",
	"胡老师：啧…既然也不在这个人身上，那到底会在哪？",
	"胡老师：如果真的有这个赵如花，那她现在应该还在学校的某处才对。",
	"胡老师：但要是这是你瞎编的，你会把我们几个都害得很惨！",
	"老哥：呜呜呜…都说了是真的啦…",
	"李上天：说不定来的不是赵如花本人，是职业杀手什么的。",
	"李上天：使用麻醉剂的话，让老哥先生昏迷一上午也完全没问题。",
	"李上天：再使用开锁套装打开办公室的门，偷走里面的U盘…",
	"李上天：哼，没准还有攀爬设备，现在已经翻墙逃走了也说不定。",
	"胡老师：这…应该是职业小偷吧！",
	"你：说起来，老师的U盘是什么样子的？",
	"胡老师：SanDisk的纯金属U盘，上面挂着一个小瓶。",
	"你：小瓶？",
	"胡老师：嗯，是健身时用的嗅盐，吸一口贼爽，可惜后来几乎没什么用了。",
	"你：（这样也不能阻止你的堕落吗！）",
	"李上天：比起这个，还有一些地方没有搞清楚。",
	"李上天：你们两个到达现场的时间顺序，以及凶手是如何进入上锁的办公室的。",
	"老哥：说起来，我找到衣服的工具间就没有上锁呢！",
	"你：（工具间没有上锁，是那个人做的吧…）",
	"你：工具间是王最强撬的锁，后来大概是没锁上吧。",
	"老哥：那这个王最强应该是个撬锁高手，所以也有可能撬开办公室的锁咯！",
	"你：不…工具间的锁都是挂锁，但办公室的锁就不一样了。",
	"你：我并不觉得会有人冒着被抓的危险在办公室门口慢慢撬锁…",
	"老哥：呃…那还是回到第一个问题吧。",
	"老哥：通知开会的时间是七点，我也是差不多那时候到的。",
	"老哥：后来…具体过了多长时间不太清楚，醒来的时候应该是接近中午了。",
	"胡老师：我到办公室的时间是七点半左右，之后在案发现场大约待了十几分钟，回到办公室后U盘就没有了。",
	"李上天：也就是七点半以后，U盘才被偷走。",
	"李上天：此时的我们已经被王最强弄昏过去了，这样一来…",
	"你：我和李上天的嫌疑就解除了！",
	"李上天：不，你是傻子吗？",
	"你：…诶？",
	"李上天：除了那个什么如花，此时还能自由行动的就只剩下那个人了。",
	"你：（李上天说的那个人是指…）",
	"你：王最强？！",
	"李上天：哼，就是这样。",
	"李上天：在把我们弄昏之后，找准时机偷走U盘，再迅速回到教室破坏门锁。",
	"你：不，不会吧…",
	"胡老师：虽然很难相信，但如果是王最强的话，会和杨日龙串通起来也就很合理了。",
	"胡老师：而且，或许他真的能快速撬开办公室的门锁呢？",
	"你不由得望向躺在教室后排的王最强，实在难以接受他杀害班长的结论。",
	"就在这时，你看到了惊人的一幕。"
];
	
function checkques(){
	switch(i){
	case 1:inputword();break;
	case 18:selitm();break;
	case 84:inputword();break;
	case 99:inputword();break;
	case 107:end();}
	window.scrollTo(0,document.body.scrollHeight);}
	
function checkans(me){
	switch(i){
	case 1:
		if((document.getElementsByTagName("input")[0].value == "老哥")||(document.getElementsByTagName("input")[0].value == "清洁工")){
			addevd("一开始你还以为是自己眼花了，但看清那人的真面目后，你简直惊得想要戳瞎自己。");
			correct();}
			else{alert("没答对哦！");}break;
	case 18:
		if(me.className == "btn 7"){correct();}
		else{alert("没选对哦！");}break;
	case 84:
		if(document.getElementsByTagName("input")[0].value == "王最强"){
			addevd("王最强：我之前上楼搜刮了一波，发现二楼有个工具间，很容易撬开的，里面啥都有。");
			correct();}
			else{alert("没答对哦！");}break;
	case 99:
		if(document.getElementsByTagName("input")[0].value == "王最强"){
			addevd("王最强：于是我今天提前过来，用自制的烟雾弹把你们弄昏，之后锁上了教室门，并用焊枪破坏了门锁。");
			correct();}
			else{alert("没答对哦！");}}}

function skip(){
	while((i!=1)&&(i!=18)&&(i!=84)&&(i!=99)&&(i!=107)){
		next();}}