var lines = [
	"杨日龙的手指扭动了一下，随后又静止不动了。",
	"一开始你还怀疑是自己看错了，但没过多久，杨日龙就直接坐了起来，目光呆滞地望向你们这边。",
	"你：…",
	"老哥：…",
	"李上天：…",
	"胡老师：杨日龙！！！",
	"你：老师！你不是说他死了吗？还腹部被人刺伤？？？",
	"胡老师：这…当然是我骗你们的嘛！为了让我显得可靠一点！",
	"李上天：呵，没用的大人。",
	"杨日龙：那个…如花没有来吗？",
	"你：！",
	"你：（看来真的有赵如花这个人，并且今天应该到场…）",
	"胡老师：没来，比起这个，你的同伙在哪？",
	"杨日龙：同伙？什么意思？",
	"胡老师：别犯傻，你们假装要搞谈判，骗我把包放到办公室，之后趁我过来谈判的时候偷走了我的U盘！",
	"杨日龙：我没偷老师的U盘，也没有假装要搞谈判，我真…",
	"胡老师：我没说是你偷的，是你的同伙偷的，你昨天找我借书，目的就是要让我今天把包放在办公室，制造行窃的时机！",
	"胡老师：然后你的同伙将你打晕，制造死亡现场来吸引我的注意，趁机偷走了U盘！",
	"杨日龙：什么鬼啊！都说了没有同伙，而且借那些书也只是单纯想看而已！",
	"杨日龙：我是真心准备要谈判的，今天很早就来了，还想着要布置一下会场！",
	"杨日龙：结果好像突然被谁掐住了后颈，莫名其妙昏过去了，醒来之后就变成了现在这样！",
	"你：掐…掐后颈？",
	"你：（和老哥的描述惊人地相似…是同一个人做的吗？）",
	"胡老师：奇怪了…这到底是…",
	"李上天：哼，比起这个，那个赵如花是什么人？",
	"杨日龙：啊…是我的女朋友。",
	"杨日龙：这也是今天要谈判的目的，劝说她的父母让她继续留在学校上学。",
	"你：（…都绑架自己班同学了，你管这叫劝说？）",
	"杨日龙：不过看起来，她和她的父母今天都没有来的样子。",
	"杨日龙：被放鸽子还莫名其妙被人弄昏…真是不幸的一天。",
	"李上天：那个赵如花很厉害么？",
	"杨日龙：没有啊，很普通的妹子…",
	"杨日龙：如花的成绩很差，她的父母决定下学期开始送她去学电脑控制挖掘机炒菜。",
	"李上天：噢，那还真是很厉害呢。",
	"你：（班长对于U盘的事情并不知情的样子。）",
	"你：（所以，向老师借书真的就只是巧合？）",
	"杨日龙：卧槽，王最强？！",
	"胡老师：呃…他现在暂时昏过去了，但是不知道是什么原因。",
	"胡老师：我U盘上挂着嗅盐，如果能找回来让他闻一下，就…",
	"杨日龙：嗅盐？那是什么？",
	"胡老师：就是能产生氨气的东西，还有些酒精和香料什么的，闻一下就能恢复神智。",
	"杨日龙：哦，不用那么麻烦，掐人中就行了。",
	"胡老师：纳尼！",
	"杨日龙对着王最强掐了一会儿，没过多久，王最强也醒了过来。",
	"王最强：杨日龙！你没死啊！",
	"王最强：呜呜呜…杨日龙…",
	"杨日龙：呃…你还记得发生什么事了吗？",
	"王最强：我看你迟迟没有发来引爆消息，就过来看看，结果看到你像被人杀了一样…然后就失去意识了。",
	"你：没有被掐后颈？",
	"王最强：没有，为什么？",
	"你：不，没什么。",
	"你：（应该只是单纯吓晕过去了吧…）",
	"胡老师：感人的重逢就到此为止吧，差不多该进入正题了。",
	"胡老师：可能偷走U盘的，现在只有王最强和赵如花两个人。",
	"杨日龙：那个…我看到如花发来的短信了，说今天不能来学校，就请了一个熟人代替参加。",
	"老哥：呃…那指的就是我吧？",
	"胡老师：王最强，你有什么要说的？",
	"王最强：啥U盘？我没印象！",
	"胡老师：废话少说，掐昏杨日龙，趁着我上楼参加谈判的空档，潜入办公室偷走U盘的真凶，就是你！",
	"王最强：什么？不可能！我只会用武力开门，撬办公室的锁绝对会留下明显痕迹！",
	"你：（但如果有钥匙，那就不一样了…）",
	"你：（王最强曾经和那个有钥匙的人接触过…）",
	"你：应该是从门卫大爷那里拿到的钥匙吧？",
	"王最强：什么啊！我才没有做那么无聊的事情！",
	"李上天：哼，你刚才说漏嘴了，为什么会知道办公室的门是锁上的？",
	"王最强：其实…我早就醒过来了，迷迷糊糊有听到一点你们谈话的内容，没想到吧！",
	"李上天：什么？！",
	"你：（可恶，竟然无法反驳。）",
	"李上天：…",
	"李上天：事到如今，我也就不隐瞒了。",
	"李上天：关于U盘所在的位置，我已经有了重要的线索。",
	"胡老师：什么！在哪？",
	"李上天：我独自行动的那些时间，其实一直待在洗手间里面。",
	"李上天：…",
	"你：难…难道是…",
	"胡老师：在洗手间里？",
	"你：老师！这个人只要附近有酒的味道，就会拉肚子！",
	"李上天：不要把我跟那种污秽的词放在一个句子里面！！！",
	"你：呃…就会想去洗手间…",
	"你：（所以，U盘所在的地方就是…）",
	"你：如果U盘还和嗅盐连接在一起的话，那大概是在教室里！",
	"李上天：哼，终于。",
	"李上天：而进出过教室的人只有我们几个，是谁偷的就显而易见了。",
	"王最强：啧，仅凭这样就能证明U盘在教室？",
	"王最强：哪里有U盘？现在就回去找找，根本没有那种东西。",
	"王最强：今天一大早就来教室搞事情，光看住你们这群杂鱼就累得要死了，哪有闲心偷U盘？",
	"你：杂…杂鱼…",
	"你：（看起来很理直气壮的样子，难道是我们想错了？）",
	"你：（消失的U盘，莫名其妙被掐住的后颈…）",
	"你：…",
	"老哥：那个…果然还是再考虑一下另一个人的作案嫌疑比较好吧？",
	"老哥：毕竟只凭短信不能证明她没有来学校…",
	"胡老师：什么！好不容易到了这一步，又要重新思考了吗？",
	"杨日龙：不不不，如花是个柔弱的女孩子，就算掐人也不可能会这么大的威力！",
	"说着，杨日龙掏出了手机，给你们看她的照片。",
	"那确实是一个文静的女孩子，样子娇小可爱，看不出有任何暴力倾向。",
	"杨日龙：还有这个，这个，这个…",
	"你：行啦！别再秀恩爱了！",
	"胡老师：都别说了，还是直接去教室搜查一下比较快！",
	"所有人一起离开了杀人现场，向位于一楼的教室走去。"
	];
	
function checkques(){
	switch(i){
	case 61:inputword();break;
	case 79:inputword();break;
	case 99:end();}
	window.scrollTo(0,document.body.scrollHeight);}
	
function checkans(me){
	switch(i){
	case 61:
		if((document.getElementsByTagName("input")[0].value.match("门卫"))||(document.getElementsByTagName("input")[0].value.match("大爷"))){
			addevd("王最强：也不要想着找门卫大爷，大爷最近都不会在哦，哈哈哈哈…");
			correct();}
			else{alert("没答对哦！");}break;
	case 79:
		if(document.getElementsByTagName("input")[0].value == "教室"){
			addevd("这时，李上天突然急匆匆地跑出了教室。");
			correct();}
			else{alert("没答对哦！");}}}

function skip(){
	while((i!=61)&&(i!=79)&&(i!=99)){
		next();}}