var lines = [
	"你们来到教室门口。",
	"胡老师：你们两个进来跟我一起找，其他人就待在外面。",
	"李上天：不，我就算了，以免引起身体不适。",
	"胡老师：行吧，那就我们两个。",
	"你：…",
	"胡老师率先走进了教室，你犹豫了一下，转向身后的王最强。",
	"你：那个U盘…里面有什么吗？",
	"王最强没有回答，但在那一瞬间，你注意到他的脸上露出了十分痛恨的表情。",
	"你抛开身后的众人，转身进入教室。",
	"胡老师正在王最强的座位附近寻找，不过看起来一无所获。",
	"胡老师：可恶…到底藏在哪里！",
	"你：胡老师。",
	"你：那个U盘，里面装的是见不得人的东西吧。",
	"胡老师：你…你在胡说什么呢！",
	"你：老师又不是什么顶级科研机构的人员，不可能有国家机密文件之类的。",
	"你：资料被盗这种事，交给警察解决才是最快的办法。",
	"你：但是，你却一直坚持不让我们报警，还以各种理由糊弄我们。",
	"你：你说偷U盘与案件有关，是因为收到了…",
	"你：因为收到了预告短信，看到讲台上的纸条，就认为是同一个人做的。",
	"你：但是仔细想想，老师在看到纸条上的内容时，马上就联想到U盘被偷…",
	"你：一般对于已经删掉的骚扰短信，会记得这么清楚吗。",
	"你：而且如果已经知道了会被偷，一开始就不会把U盘留在办公室里了吧。",
	"你：所以，那个预告短信，应该是老师瞎编的吧？",
	"胡老师：…",
	"你：如果没有预告短信，老师来到现场后应该也是一片茫然的状态。",
	"你：就算看到讲台上的纸条，也不应该联想到自己的东西被偷才对。",
	"你：所以…其实你回办公室的目的并不是想检查U盘是否还在，而是…",
	"你：（为了拿那个东西…）",
	"你：你之所以会回去检查包里的东西，其实是为了拿嗅盐吧？",
	"你：因为你发现班长并没有死，于是打算将其唤醒。",
	"你：但就在这时，你发现U盘被人偷了。",
	"胡老师：…",
	"胡老师：真不愧是你啊。",
	"你：你隐瞒了班长还活着的事实，是为了让我们相信预告短信是真的，从而不报警帮你找U盘。",
	"你：那个无论如何也要拿回的U盘，里面必定装着别人不能看的东西，特别是警察不能看…",
	"你：王最强偷走U盘我已经确信了，不过看他的样子似乎是想要将其毁掉…",
	"你：那个gay里gay气的王最强…",
	"你：…",
	"胡老师：你知道的太多了…",
	"你：哈哈哈，我都不知道老师以前有健身过。",
	"胡老师露出了一丝无奈的笑容。",
	"胡老师：嗯，你们中知道的只有小强一个人，那瓶嗅盐也是他当时送我的礼物。",
	"你：呃…那还能用吗！",
	"胡老师：不知道，不过这些都无所谓吧。",
	"胡老师：我也只是…想要保留一些美好的东西而已啊。",
	"你：（不，你这个变态…）",
	"你：小强的心已经是班长的了…",
	"胡老师：哈哈哈，知道知道。",
	"胡老师：但那不过是一些录像而已，为何不能让我拥有？",
	"你：不！你这个变态！！！",
	"你：（快，动脑筋…）",
	"你：（想要摧毁一个U盘，应该用什么方法？）",
	"你：（王最强决定在今天动手，不会是没有意义的决定…）",
	"你：（因为…在今天会用到那个东西！）",
	"你：王最强！！！",
	"你：引爆开关在哪？",
	"墙壁外面的人迟疑了一秒，很快给出了回应。",
	"王最强：你老婆的五三！",
	"胡老师：什么？？？",
	"你迅速冲向李上天的位置，这种时候已经顾不上吐槽了。",
	"你瞄准桌上一堆教辅资料中的五三，奋力将其抽了出来。",
	"这是一本去年用的旧书，中间被挖出一个大洞，里面埋着一个带按钮的小面板。",
	"你二话不说按下了按钮，只听“砰”的一声巨响，你脚下的瓷砖微微震了一下，然后什么也没有发生。",
	"几秒后，你闻到一股比老哥还要刺激的气味。",
	"胡老师：…",
	"你：行了，都结束了，走吧。",
	"你走出教室，所有人都以一种吃瓜群众的目光看向你。",
	"除了王最强，向你小声说了句“谢谢”，就没再多说话了。",
	"你回过头去，胡老师静静地站在一片氨气之中，那孤独的身影散发出一种窒息一般的悲伤。"
];
	
function checkques(){
	switch(i){
	case 17:inputword();break;
	case 27:inputword();break;
	case 53:inputword();break;
	case 68:end();}
	window.scrollTo(0,document.body.scrollHeight);}
	
function checkans(me){
	switch(i){
	case 17:
		if((document.getElementsByTagName("input")[0].value.match("预告"))||(document.getElementsByTagName("input")[0].value.match("短信"))){
			addevd("胡老师：就在昨天，我收到一条奇怪的短信，内容莫名其妙，于是就直接删掉了。");
			correct();}
			else{alert("没答对哦！");}break;
	case 27:
		if(document.getElementsByTagName("input")[0].value == "嗅盐"){
			addevd("胡老师：就是能产生氨气的东西，还有些酒精和香料什么的，闻一下就能恢复神智。");
			correct();}
			else{alert("没答对哦！");}break;
	case 53:
		if((document.getElementsByTagName("input")[0].value == "引爆装置")||(document.getElementsByTagName("input")[0].value == "炸弹")){
			addevd("王最强：我还用废零件做了引爆装置，不过杨日龙一直没给我发消息，所以还没有机会引爆。");
			correct();}
			else{alert("没答对哦！");}}}

function skip(){
	while((i!=17)&&(i!=27)&&(i!=53)&&(i!=68)){
		next();}}