var evs = [[],//0：体重变化 1：文字 234：选项 5：tag
[0,"——　Day1　——",0,0,0,""],
[0,"今天是开学第一天，XXX穿着心爱的——去参加班会。",1,2,3,""],
[-1,"回到宿舍，XXX的貂皮大衣已经湿透了，她拧干里面的汗水，发现自己轻了一斤。",0,0,0,""],//3
[-2,"由于整天没有吃东西，回到宿舍时，XXX已经饿成了一具干尸。",0,0,0,""],//4
[0,"当晚室友聊天时突然问起XXX的体重，XXX——",4,5,6,""],
[0,"——　Day2　——",0,0,0,""],
[0,"XXX在食堂打了一碗饭，正要吃时，突然发现饭里有虫子，XXX露出了——的表情。",7,8,9,""],
[0,"一个长得很漂亮的同班同学加了XXX的QQ，表示想成为朋友，XXX——",10,11,12,""],//8
[0,"由于没有犯下实际罪行，XXX很快就被放了出来，但同班同学已经不再理她了。",0,0,0,""],//9
[0,"老师布置了小组作业，有写文稿、做PPT、上台演讲三项分工，XXX深思熟虑，最后决定——",13,14,15,""],
[0,"XXX和其他组员划拳决定谁上台演讲，XXX出——",16,17,18,""],//11
[0,"XXX回到宿舍，发现自己的胖次全部神秘失踪，机智的XXX一想就知道了是谁干的，于是——",19,20,21,""],//12
[+1,"室友发现胖次不见了，马上向辅导员举报，XXX反应迅速，将胖次全部吃了下去，最后没有被辅导员抓住。",0,0,0,""],//13
[0,"——　Day3　——",0,0,0,""],
[-1,"早晨，XXX看见镜中自己的秃头，急得浑身发抖，她的体重抖落了一斤。",0,0,0,""],//15
[0,"今天是下雨天，XXX下楼取外卖时看见室友正朝这边走来，于是她——",22,23,24,""],
[0,"XXX突然肚子剧痛倒在了地上，经医院抢救终于活了过来，医生问XXX为什么要吃胖次，XXX回答——",25,26,27,""],//17
[0,"长得很漂亮的同班同学约XXX一起吃午饭，XXX非常感动，临走时，XXX决定送她——",28,29,30,""],//18
[0,"XXX去取快递，当她经过拐角时，嫉妒自己的室友突然出现，XXX大吃一惊，——",31,32,33,""],//19
[+2,"晚上，室友的毒药突然发作，XXX感到一阵眩晕，她的体重竟然神奇地增加了！",0,0,0,""],//20
[0,"XXX正躺在床上，突然收到一条短信，上面写着“敢凶我女朋友，你已经死了”。",0,0,0,"被人盯上"],//21
[0,"——　Day4　——",0,0,0,""],
[-1,"早晨，XXX看见镜中自己的秃头，急得浑身发抖，她的体重抖落了一斤。",0,0,0,""],//23
[0,"XXX去图书馆自习，但在图书馆遇到了吵吵闹闹的小情侣，XXX一怒之下——",34,35,36,""],//24
[0,"XXX离开后，图书馆突然发生了大爆炸，XXX得意地“哼”了一声，扬长而去。",0,0,0,""],//25
[0,"还有两天就要小组演讲了，XXX决定开始工作，于是——",37,38,39,""],//26
[0,"还有两天就要小组演讲了，XXX的任务是上台演讲，她决定——",43,44,45,""],//27
[0,"XXX正在摸鱼，突然发现自己的桌上有一袋来路不明的棉花糖，XXX——",46,47,48,""],//28
[0,"长得很漂亮的同学约XXX后天晚上看电影！XXX十分激动，于是——",49,50,51,""],//29
[+999,"十分钟后，XXX又活过来了，原来是室友给她做了人工呼吸，XXX的心中突然产生了前所未有的感情……",0,0,0,"渣女"],//30
[-1,"XXX看了眼自己的体重，觉得自己实在太轻了，不禁感到一丝焦虑。",0,0,0,""],//31
[0,"想到自己已有一定知名度，XXX决定成为一名网红！她打算将自己唱——的视频发到霹雳霹雳平台。",52,53,54,""],//32
[+2,"晚上，XXX突然感到一阵眩晕，她意识到那袋棉花糖被室友下了毒！XXX的体重神奇地增加了。",0,0,0,""],//33
[-1,"XXX打了一晚上的游戏而忘记吃晚饭，她的体重减轻了。",0,0,0,""],//34
[-1,"想到自己两天后要用带二刺猿插图的PPT演讲，XXX感到十分憔悴，她的体重减轻了。",0,0,0,""],//35
[0,"收到班群通知：周日将在体育馆进行体测。",0,0,0,""],
[0,"——　Day5　——",0,0,0,""],
[-1,"早晨，XXX看见镜中自己的秃头，急得浑身发抖，她的体重抖落了一斤。",0,0,0,""],//38
[0,"XXX的室友们正在聊天，突然开始互相吹捧起对方的身材，XXX站在一旁，决定——",55,56,57,""],
[0,"XXX去医院补牙，花掉了这个月所有的零用钱。",0,0,0,"贫穷"],//40
[0,"XXX去医院补牙，花掉了这个月所有的零用钱，但她在包里发现了五百块钱而幸运地没有挨饿。",0,0,0,""],//41
[0,"XXX正在教室自习，突然冲进一个男生，自称是XXX的粉丝，XXX淡定地回道——",58,59,60,""],//42
[0,"XXX走在路上，突然下起了大雨，这时两个熟人同时打着伞出现，XXX立刻跑向了——",61,62,63,""],//43
[-1,"因为感冒发烧，XXX流掉了一斤的汗水。",0,0,0,""],//44
[0,"XXX一个人在宿舍，突然感到饥饿难耐，但自己已经没有食物了！慌乱之中，XXX将魔爪伸向了室友桌上的——",64,65,66,""],
[0,"晚上，XXX收到了室友们一起送的奶茶，她怀着感激的心情将奶茶放进了四次元口袋里。",0,0,0,"室友的关怀"],//46
[-1,"XXX打开记账本，发现今天已经没有钱买零食了，她闭上眼睛，流下了不争气的口水。",0,0,0,""],//47
[-1,"想到自己明天要用带二刺猿插图的PPT演讲，XXX感到十分憔悴，她的体重减轻了。",0,0,0,""],//48
[-1,"XXX感觉有点不太舒服，她在床上辗转反侧终于入睡，消耗了一层脂肪。",0,0,0,""],//49
[0,"——　Day6　——",0,0,0,""],
[-1,"早晨，XXX看见镜中自己的秃头，急得浑身发抖，她的体重抖落了一斤。",0,0,0,""],//51
[0,"买早饭时，食堂阿姨看着XXX的平胸，多给了XXX一个面包，XXX受宠若惊。",0,0,0,"阿姨的关怀"],//52
[0,"今天是小组演讲的日子，由于XXX忘记准备导致全组被罚，激起了组员的仇恨。",0,0,0,"被人盯上"],//53
[0,"今天是小组演讲的日子，由于XXX随便应付导致演示效果极差，激起了组员的仇恨。",0,0,0,"被人盯上"],//54
[0,"今天是小组演讲的日子，XXX的小组得到了老师的表扬，组员邀请XXX一起吃午饭，在餐厅里，XXX——",67,68,69,""],//55
[0,"今天是小组演讲的日子，XXX的小组讲述的人生哲理故事感动了所有人，但因严重偏离主题而被打零分。",0,0,0,""],//56
[0,"今天是小组演讲的日子，XXX的小组展示的艺术PPT惊艳了所有人，但因过于喧宾夺主导致演讲没有及格。",0,0,0,""],//57
[0,"今天是演讲的日子，XXX站上了讲台，但由于自闭一个字都没讲出来，激起了组员的仇恨。",0,0,0,"被人盯上"],//58
[-2,"今天是演讲的日子，XXX用带二刺猿插图的PPT上台演讲，遭到了全班同学的讥笑。XXX感到十分憔悴，她的体重大大地减轻了。",0,0,0,""],//59
[-2,"今天是演讲的日子，当XXX拿到PPT后发现组员竟然用二刺猿插图，只能顶着压力上台演讲，她的体重因为压力而减轻了。",0,0,0,"尴尬癌"],//60
[-1,"下课后，XXX由于懒得吃饭而直接回到了宿舍，她的体重减轻了。",0,0,0,""],//61
[0,"XXX是【seiheki】这件事被室友发现了！为了让室友闭嘴，XXX——",70,71,72,""],//62
[0,"XXX总觉得室友看自己的目光变得恐怖了。",0,0,0,"被人盯上"],//63
[0,"XXX的小迷弟不知从哪获得了XXX的QQ，XXX回了一句——",73,74,75,""],//64
[0,"XXX的小迷弟说要给XXX回礼，XXX淡定地答应了。",0,0,0,"迷弟的关怀"],//65
[-1,"XXX打开记账本，发现今天已经没有钱买零食了，她闭上眼睛，流下了不争气的口水。",0,0,0,""],//66
[-1,"当晚，长得很漂亮的同班同学始终没有来，XXX站在狂风中，一直等到自己饿得不行才回了宿舍。",0,0,0,""],//67
[0,"当晚，XXX和长得很漂亮的同班同学在电影院度过了愉快的时光，走出电影院，XXX决定表现一下自己，于是提议去——",76,77,78,""],//68
[-2,"XXX半夜在厕所吐得天昏地暗，她的体重大大地减轻了。",0,0,0,""],//69
[0,"——　Day7　——",0,0,0,""],
[-1,"早晨，XXX看见镜中自己的秃头，急得浑身发抖，她的体重抖落了一斤。",0,0,0,""],//71
[0,"XXX打开手机，突然发现微信支付宝里的钱都没有了，机智的她一想就明白了是谁干的，于是——",79,80,81,""],//72
[-1,"XXX已经穷得买不起早饭了，她闭上眼睛，流下了不争气的口水。",0,0,0,""],//73
[-2,"XXX走在去体育馆的路上，突然被一群人围住，XXX还没反应过来就被揍成了纸片人。",0,0,0,""],//74
[-1,"XXX来到体育馆，看到眼前的人群，XXX的【heki】又犯了，她的双腿不停地发抖，体重抖落了一斤。",0,0,0,""],//75
[0,"XXX来到体育馆，大家已经排好队准备进行体测了。",0,0,0,""],//76
[0,"班长介绍：先测五十和八百米，再测各种杂项，最后测体重。",0,0,0,""],
[0,"开始测五十米了，XXX像——一样冲了出去。",82,83,84,""],
[+1,"由于嗓子喊哑了，XXX一口气喝了两瓶水，她的体重增加了！",0,0,0,""],//79
[0,"开始测八百米了，XXX——",85,86,87,""],
[-1,"XXX被送入医务室，医生竟然开错了药，XXX吃下后感觉身体被掏空。",0,0,0,""],//81
[0,"开始排队测各种杂项，XXX突然看到一个熟悉的身影，她握紧了口袋里的花，——",88,89,90,""],//82
[0,"长得很漂亮的同班同学愣了一会儿，低下头说了句“谢谢”就走了。",0,0,0,""],//83
[0,"开始排队测各种杂项。",0,0,0,""],//84
[0,"测完杂项就是体重了，听说测体重的老师十分严格，凡是体重不足80的学生都会被劝退，XXX不禁倒吸一口凉气。",0,0,0,""],
[+1,"XXX想起医生曾经送过自己可以吃的胖次，连忙吃了下去，她的体重增加了！",0,0,0,""],//86
[+1,"XXX想起室友曾经送过自己一杯奶茶，连忙喝了下去，她的体重增加了！",0,0,0,""],//87
[+1,"XXX想起食堂阿姨曾经送过自己一块面包，连忙吃了下去，她的体重增加了！",0,0,0,""],//88
[+1,"XXX的小迷弟突然出现，并送给XXX一瓶肥宅水，XXX连忙喝了下去，她的体重增加了！",0,0,0,""],//89
[0,"轮到XXX测体重，XXX站上了体重计。",0,0,0,""],
[0,"由于体重不达标，XXX被赶出了学校，她的大学生活就这样悲惨地结束了。",0,0,0,""],//91
[0,"【结局1/3：格格不入】",0,0,0,""],
[0,"由于体重不达标，XXX被赶出了学校，她的大学生活就这样悲惨地结束了。",0,0,0,""],//93
[0,"本应是这样，但XXX很快被人买回了学校，在校门口，XXX遇到了长得很漂亮的同班同学。",0,0,0,""],
[0,"“谢谢你的钱，这是我欠你的。”长得很漂亮的同班同学说。",0,0,0,""],
[0,"XXX望着她的眼睛，说出了——",91,92,93,""],
[0,"从此，XXX成为了长得很漂亮的同班同学的坐骑，两人过上了幸福的生活。可喜可贺！",0,0,0,""],
[0,"【结局3/3：百合夫妻】",0,0,0,""],
[0,"XXX的体重达标了，没有被劝退，XXX流下了感动的泪水。",0,0,0,""],//99
[0,"就这样，XXX在大学的第一周顺利结束了。以后也要努力存活下来啊，XXX！",0,0,0,""],
[0,"【结局2/3：生存高手】",0,0,0,""]
];

var sels = [[],//0：体重变化 1：选项文字 2：结果文字 3：tag
[0,"貂皮大衣","今天是开学第一天，XXX顶着38度的高温穿貂皮大衣参加班会，引起了全班同学的关注。","贵妇"],
[0,"衬衫和牛仔裤","今天是开学第一天，XXX穿着心爱的衬衫和牛仔裤去参加班会，给大家留下了正经的印象。","老实人"],
[0,"大裤衩大拖鞋","今天是开学第一天，XXX穿着大裤衩大拖鞋去参加班会，没想到路上刮起了狂风，XXX被吹到了树上，直到傍晚才被救下。","失踪人口"],
[0,"实话实说","当晚室友聊天时突然问起XXX的体重，XXX实话实说，第二天她的辣条就被人偷走了。","遭人嫉妒"],
[0,"说100斤","当晚室友聊天时突然问起XXX的体重，XXX说自己100斤，但因说不出瘦腿方法而被室友记恨。","遭人嫉妒"],
[0,"保持沉默","当晚室友聊天时突然问起XXX的体重，XXX一言不发，室友们都很担心她的未来。","自闭"],
[-1,"震惊","XXX在食堂打了一碗饭，正要吃时，突然发现饭里有虫子，XXX花容失色，一掌将桌子劈成两半，光速逃离了食堂。","洁癖"],
[-1,"慈爱","XXX在食堂打了一碗饭，正要吃时，突然发现饭里有虫子，XXX露出了慈爱的表情，并对虫子做起了人工呼吸，以至于当天的饭没有吃成。","恋虫癖"],
[0,"冷漠","XXX在食堂打了一碗饭，正要吃时，突然发现饭里有虫子，XXX露出了冷漠的表情，并毫不犹豫地将虫子吃了下去。","勇士"],
[0,"愤怒","一个长得很漂亮的同班同学加了XXX的QQ，表示想成为朋友，XXX回了一句“滚！”便将对方拉入黑名单。","粗鲁"],
[0,"兴奋","一个长得很漂亮的同班同学加了XXX的QQ，表示想成为朋友，XXX兴奋地对着该同学的QQ空间撸了一发，被室友发现并送入警察局。","变态"],
[-1,"羞涩","一个长得很漂亮的同班同学加了XXX的QQ，表示想成为朋友，XXX羞涩得满地打滚，燃烧掉一层脂肪。","怀春少女"],
[0,"写文稿","老师布置了本周小组作业，有写文稿、做PPT、上台演讲三项分工，XXX提出要写文稿，但其他组员也想做这个。","混子"],//13
[0,"做PPT","老师布置了本周小组作业，有写文稿、做PPT、上台演讲三项分工，XXX提出要做PPT，但其他组员也想做这个。","混子"],//14
[0,"上台演讲","老师布置了本周小组作业，有写文稿、做PPT、上台演讲三项分工，XXX提出要上台演讲，得到了其他组员的肯定。","演讲达人"],//15
[0,"剪刀","XXX和其他组员划拳决定谁上台演讲，XXX不幸被秒，获得了上台演讲的任务。","loser"],//16
[0,"石头","XXX和其他组员划拳决定谁上台演讲，XXX赢了，不用上台演讲，但也耗尽了她今年所有的运气。","非洲人"],//17
[0,"布","",""],//18
[0,"不屑一顾","XXX回到宿舍，发现自己的胖次全部神秘失踪，机智的XXX一想就知道了是谁干的，便“呵”了一声，从此再也不穿胖次。","真空"],
[0,"与室友搏斗","XXX回到宿舍，发现自己的胖次全部神秘失踪，机智的XXX一想就知道了是谁干的，于是抄起晾衣棍和室友大战三百回合，最后各损失半边头发。","英年早秃"],
[0,"偷室友胖次","XXX回到宿舍，发现自己的胖次全部神秘失踪，机智的XXX一想就知道了是谁干的，于是也偷偷拿走了对方的胖次。","有仇必报"],
[0,"冲了出去","今天是下雨天，XXX下楼取外卖时看见室友正朝这边走来，XXX激动地冲进了雨里，因为湿身被室友发现穿儿童内衣而遭到嘲笑。","搓衣板"],
[-1,"默默溜走","今天是下雨天，XXX下楼取外卖时看见室友正朝这边走来，XXX装作一滩水想从室友脚底下溜走，结果被一脚踩成粉碎性骨折。","虚弱"],
[0,"炫耀午饭","今天是下雨天，XXX下楼取外卖时看见室友正朝这边走来，XXX得意地拿出刚买的窝窝头吃了起来，室友向她投来怜悯的目光。","贫穷"],
[0,"摔进去的","XXX突然肚子剧痛倒在了地上，经医院抢救终于活了过来，医生问XXX为什么要吃胖次，XXX说自己摔了一跤坐进去的，第二天这件事在各大社交平台广为流传。","传奇人物"],
[0,"因为爱","XXX突然肚子剧痛倒在了地上，经医院抢救终于活了过来，医生问XXX为什么要吃胖次，XXX回答因为爱，医生听后流下了感动的泪水，并将自己私下研制的可食用胖次送给了XXX。","医生的关怀"],
[0,"不记得了","XXX突然肚子剧痛倒在了地上，经医院抢救终于活了过来，医生问XXX为什么要吃胖次，但XXX似乎失去了前一天的记忆，最后被莫名其妙地送回了学校。","失忆"],
[0,"食堂的包子","长得很漂亮的同班同学约XXX一起吃午饭，XXX非常感动，于是买了食堂的包子送她，对方高兴地收下了，从此再也没联系过XXX。","质朴"],
[0,"一个吻","长得很漂亮的同班同学约XXX一起吃午饭，XXX非常感动，冲上去狂亲对方，但被对方以更快的速度舌吻20回，最后晕倒在食堂。","坠入爱河"],
[0,"吃鸡激活码","长得很漂亮的同班同学约XXX一起吃午饭，XXX非常感动，准备送她吃鸡激活码，结果发现对方是吃鸡老玩家并加了好友。","沉迷游戏"],
[0,"目瞪口呆","XXX下楼取快递，当她经过拐角时，嫉妒自己的室友突然出现，XXX惊得目瞪口呆，被眼疾手快的室友往嘴里塞入了毒药！","被下毒"],
[0,"螺旋升天","XXX下楼取快递，当她经过拐角时，嫉妒自己的室友突然出现，XXX大吃一惊，变成一个螺旋钻穿破了云层，为人间带来了久违的光明。","传奇人物"],
[0,"脚趾抓地","XXX下楼取快递，当她经过拐角时，嫉妒自己的室友突然出现，XXX尴尬得用脚趾抠出了古巴比伦空中花园，第二天就成了学校名人。","传奇人物"],
[0,"拍照发WB","XXX早上去图书馆自习，但在图书馆遇到了吵吵闹闹的小情侣，XXX一怒之下拍照发WB，但很快就不知被什么人删掉了。","被人盯上"],
[0,"写同人文","XXX早上去图书馆自习，但在图书馆遇到了吵吵闹闹的小情侣，XXX一怒之下写成五万字小黄文发到老福特，一夜之间涨粉五十万。","太太"],
[-1,"扎小人","XXX早上去图书馆自习，但在图书馆遇到了吵吵闹闹的小情侣，XXX一怒之下扎小人诅咒他们，但遭到反噬而损失了一点体力。","诅咒师"],
[0,"随便应付","还有两天就要小组演讲了，XXX决定开始工作，于是在网上随便复制了一篇文稿就发给其他组员。","真混子"],//37
[-1,"认真完成","还有两天就要小组演讲了，XXX决定开始工作，她用了一整天的时间来写文稿，由于没吃饭导致体重轻了一斤。","靠谱"],//38
[-2,"倾注毕生心血","还有两天就要小组演讲了，XXX呕心沥血地将自己二十年来的人生感悟都写进了文稿里，她的体重减轻了。","文学大师"],//39
[0,"随便应付","还有两天就要小组演讲了，XXX决定开始工作，于是在网上随便找了一个PPT模版套进去就发给其他组员。","真混子"],//40
[-1,"认真完成","还有两天就要小组演讲了，XXX决定开始工作，她用了一整天的时间来制作PPT，由于没吃饭导致体重轻了一斤。","靠谱"],//41
[-2,"倾注毕生心血","还有两天就要小组演讲了，XXX呕心沥血地将自己二十年来对艺术的见解都做进了PPT里，她的体重减轻了。","艺术大师"],//42
[-1,"预习演讲内容","还有两天就要小组演讲了，XXX的任务是上台演讲，当她拿到PPT后发现组员竟然用二刺猿插图，当场就吐出了一口老血。","尴尬癌"],
[0,"慰问组员","还有两天就要小组演讲了，XXX的任务是上台演讲，为了让组员打起精神，她早上五点就跑到组员的寝室敲锣打鼓，结果被整层楼的人追杀。","人民公敌"],
[0,"出门玩耍","还有两天就要小组演讲了，XXX的任务是上台演讲，她跑到学校附近的商场玩了一整天，并捡到了五百块钱。","睿智"],
[0,"泪流满面","XXX正在摸鱼，突然发现自己的桌上有一袋来路不明的棉花糖，XXX泪流满面地将其锁进了柜子，决定永久珍藏。","恋物癖"],
[0,"大义凛然","XXX正在摸鱼，突然发现自己的桌上有一袋来路不明的棉花糖，正义的XXX立刻将其交给了警察。","正义使者"],
[0,"吃了下去","XXX正在摸鱼，突然发现自己的桌上有一袋来路不明的棉花糖，XXX想都没想就吃了下去。","天真"],
[+1,"狂吃","长得很漂亮的同学约XXX后天晚上看电影！XXX激动得吃了五碗饭，她的体重增加了。","暴食"],
[0,"挥拳","长得很漂亮的同学约XXX后天晚上看电影！XXX激动得一拳打碎了室友的钢铁侠手办，为了赔偿室友花光了这个月所有的零用钱。","贫穷"],
[-999,"倒地","长得很漂亮的同学约XXX后天晚上看电影！XXX激动得当场去世。",""],
[0,"团结就是力量","想到自己已有一定知名度，XXX决定成为一名网红！她将自己唱的《团结就是力量》发到了霹雳霹雳平台，但好像并没有什么很好的效果。","质朴"],
[0,"爱情买卖","想到自己已有一定知名度，XXX决定成为一名网红！她打算将自己唱的《爱情买卖》发到霹雳霹雳平台，但因太过投入而唱破嗓子，不得不提前隐退。","虚弱"],
[0,"红莲的弓矢","想到自己已有一定知名度，XXX决定成为一名网红！她将自己唱的《红莲的弓矢》发到了霹雳霹雳平台，第二天就因为五毛日语而上了首页。","新人网红"],
[0,"打醒她们","XXX的室友们正在聊天，突然开始互相吹捧起对方的身材，XXX走过来给了一人一个大嘴巴子，随后被全宿舍暴打导致牙齿被打掉。","残疾"],
[0,"拍马屁","XXX的室友们正在聊天，突然开始互相吹捧起对方的身材，XXX也跑过来给室友拍马屁，由于演技卓群而受到了室友的喜爱。","镇室之宝"],
[0,"上床睡觉","XXX的室友们正在聊天，突然开始互相吹捧起对方的身材，XXX刚起床便又回床上睡觉了，以至于当天的早课没有去上。","懒惰"],
[0,"死宅真恶心","XXX正在教室自习，突然冲进一个男生，自称是XXX的粉丝，XXX淡定地侮辱了他，但对方看起来更爽了，XXX似乎觉醒了奇怪的属性。","毒舌"],
[0,"亚拉那一卡","XXX正在教室自习，突然冲进一个男生，自称是XXX的粉丝，XXX淡定地说出了很糟糕的台词，但由于XXX是百合人设，并没有发生什么事情。","糟糕"],
[0,"你认错了","XXX正在教室自习，突然冲进一个男生，自称是XXX的粉丝，XXX淡定地回道“你认错了”，对方愣了一会儿就离开了。",""],
[0,"漂亮的同班同学","XXX走在路上，突然下起了大雨，这时两个熟人同时打着伞出现，XXX立刻跑向了漂亮的同班同学，她的室友看见这一幕后，默默地离去了。","真情实感"],
[0,"救了自己的室友","XXX走在路上，突然下起了大雨，这时两个熟人同时打着伞出现，XXX立刻跑向了救了自己的室友，她的同学看见这一幕后，默默地离去了。","见异思迁"],
[0,"相反的方向","XXX走在路上，突然下起了大雨，这时两个熟人同时打着伞出现，XXX立刻跑向了相反的方向，因为淋雨而得了感冒。","病弱"],
[-1,"苹果","XXX一个人在宿舍，突然感到饥饿难耐，但自己已经没有食物了！慌乱之中，XXX拿起室友桌上的苹果啃了一口，后因为无法消化金属制品而被送入校医院。","虚弱"],
[0,"烂胃仙","XXX一个人在宿舍，突然感到饥饿难耐，但自己已经没有食物了！慌乱之中，XXX拿起室友桌上的烂胃仙吃了下去，成功缓解了饥饿。","小偷"],
[0,"谜之小说","XXX一个人在宿舍，突然感到饥饿难耐，但自己已经没有食物了！慌乱之中，XXX拿起了室友桌上的玻璃小说，没想到这CP竟该死地甜美，XXX渐渐地嗑饱了。","妄想症"],
[+1,"大吃特吃","今天是小组演讲的日子，XXX的小组得到了老师的表扬，组员邀请XXX一起吃午饭，在餐厅里，XXX大吃特吃，大家都对她刮目相看了！","形象崩坏"],
[+1,"故作矜持","今天是小组演讲的日子，XXX的小组得到了老师的表扬，组员邀请XXX一起吃午饭，在餐厅里，XXX故作矜持，因为太假被大家喂饭喂到吐为止。","形象崩坏"],
[0,"逃跑了","今天是小组演讲的日子，XXX的小组得到了老师的表扬，组员邀请XXX一起吃午饭，XXX刚到餐厅就逃跑了，大家都觉得她很奇怪。","社恐"],
[0,"献出身体","XXX是【seiheki】这件事被室友发现了！为了让室友闭嘴，XXX从头上拔下了为数不多的几根头发送给室友，于是此事没有被公开。","英年早秃"],
[0,"亲了上去","XXX是【seiheki】这件事被室友发现了！为了让室友闭嘴，XXX亲了上去，室友愣了几秒后道：“才……才不会为了你而保密呢！”","渣女"],
[0,"威胁室友","XXX是【seiheki】这件事被室友发现了！为了让室友闭嘴，XXX抓起了室友的老婆手办，室友立刻跪在了地上，于是此事没有被公开。","恶毒"],
[0,"去你大爷","XXX的小迷弟不知从哪获得了XXX的QQ，XXX回了一句“去你大爷”，对方似乎非常兴奋。",""],
[0,"叫我主人","XXX的小迷弟不知从哪获得了XXX的QQ，XXX回了一句“叫我主人”，对方似乎非常兴奋。",""],
[0,"滚吧","XXX的小迷弟不知从哪获得了XXX的QQ，XXX回了一句“滚吧”，便将对方拉入了黑名单。","高冷"],
[0,"酒吧","XXX和长得很漂亮的同班同学在电影院度过了愉快的时光，走出电影院，两人一起去了酒吧，XXX喝得不省人事，最后被同学扛回了宿舍。","宿醉"],
[0,"如家","XXX和长得很漂亮的同班同学在电影院度过了愉快的时光，走出电影院，两人一起去了如家，XXX被对方按在床上玩到不省人事。","受"],
[0,"厕所","XXX和长得很漂亮的同班同学在电影院度过了愉快的时光，走出电影院，XXX把对方拉进厕所想要动手动脚，结果反被按在墙上玩到不省人事。","受"],
[0,"报警","XXX打开手机，突然发现微信支付宝里的钱都没有了，机智的她一想就明白了是谁干的，立刻报了警，长得很漂亮的同班同学被带走了。","正义使者"],
[0,"邪魅一笑","XXX打开手机，突然发现微信支付宝里的钱都没有了，机智的她一想就明白了是谁干的，轻声笑道：“呵，女人”，损失了五百块钱。","贫穷"],
[0,"原谅她","XXX打开手机，突然发现微信支付宝里的钱都没有了，机智的她一想就明白了是谁干的，默默地用自己仅剩的钱为她买了一束花。","舔狗"],
[0,"离弦的箭","开始测五十米了，XXX像离弦的箭一样把自己弹了出去，但立刻就掉在了地上，把大家都看傻了。","箭人"],
[0,"脱缰的马","开始测五十米了，XXX像脱缰的马一样手脚并用地冲了出去，把大家都看傻了。","野马"],
[0,"疾风闪电","开始测五十米了，XXX一边喊着“轰隆隆”一边冲了出去，把大家都看傻了。","闪电侠"],
[-2,"拼尽全力","开始测八百米了，XXX使出毕生的精力跑完了全程，然后立刻倒在了地上。","自以为是"],
[-1,"作弊跑完","开始测八百米了，XXX横穿操场少跑了半圈，但还是累得不行。","偷鸡"],
[0,"慢慢走完","开始测八百米了，XXX不慌不忙地走完了全程，成为全班倒数第一。","佛系"],
[0,"冲上去告白","开始排队测各种杂项，XXX突然看到一个熟悉的身影，她立刻冲上去把花递给那个人，并说出了自己的心意。","执着"],
[0,"冲上去打她","开始排队测各种杂项，XXX突然看到一个熟悉的身影，她立刻冲上去把花甩在那个人的脸上，对方还没反应过来，XXX就哭着跑开了。","狗血女主角"],
[0,"捏碎","开始排队测各种杂项，XXX突然看到一个熟悉的身影，她默默地看了一会儿，把口袋里的花捏碎了。","感情终结"],
[0,"骚话","XXX望着她的眼睛：“我对你付出的一切用钱是还不清的，只能用身体…”话还没说完就被对方一脚踹飞。",""],
[0,"嘲讽","XXX望着她的眼睛：“你这个死蹭得累…”话还没说完就被对方一脚踹飞。",""],
[0,"真相","XXX望着她的眼睛：“我早就知道你是可攻略角色，所以才这么舔…”话还没说完就被对方一脚踹飞。",""]
];

var ind = 0;
var weight = 86;
var name = "";
var tags = "";
var task = 0;//1:写文稿 2：做PPT 3：演讲
var tmpweight;
var seiheki;//恋虫癖/恋物癖/真空/妄想症
var heki;//自闭/社恐

function next(){
	ind += 1;
	if(evs[ind][1].match("Day")){
		var newdiv = document.createElement("div");
		newdiv.innerHTML = evs[ind][1];
		newdiv.className = "date";
		document.getElementById("ctn").appendChild(newdiv);
		next();
	}else if(evs[ind][1].match("【结局")){
		var newdiv = document.createElement("div");
		newdiv.innerHTML = evs[ind][1];
		newdiv.className = "date";
		document.getElementById("ctn").appendChild(newdiv);
		document.getElementById("next").style.display = "none";
	}else{
		switch(ind){
			case 3:if(tags.match("贵妇")){setext();}else{next();}break;
			case 4:if(tags.match("失踪人口")){setext();}else{next();}break;
			case 8:if(!tags.match("失踪人口")){setext();}else{next();}break;
			case 9:if(tags.match("变态")){setext();}else{next();}break;
			case 11:if(tags.match("混子")){setext();}else{next();}break;
			case 12:case 19:case 28:if(tags.match("遭人嫉妒")){setext();}else{next();}break;
			case 13:case 17:if(tags.match("有仇必报")){setext();}else{next();}break;
			case 15:case 23:case 38:case 51:case 71:if(tags.match("英年早秃")){setext();}else{next();}break;
			case 18:if(tags.match("怀春少女")){setext();}else{next();}break;
			case 20:if(tags.match("被下毒")){setext();}else{next();}break;
			case 21:if(tags.match("粗鲁")){setext();}else{next();}break;
			case 24:case 53:if(tags.match("非洲人")&&tags.match("失忆")){setext();}else{next();}break;
			case 25:if(tags.match("诅咒师")){setext();}else{next();}break;
			case 26:if(tags.match("非洲人")&&!tags.match("失忆")){setext();}else{next();}break;
			case 27:if(tags.match("演讲达人")||tags.match("loser")){setext();}else{next();}break;
			case 29:if(tags.match("坠入爱河")||tags.match("沉迷游戏")){setext();}else{next();}break;
			case 30:if(weight==0){setext();}else{next();}break;
			case 31:if(weight<=83){setext();}else{next();}break;
			case 32:if(tags.match("传奇人物")||tags.match("太太")){setext();}else{next();}break;
			case 33:if(tags.match("天真")){setext();}else{next();}break;
			case 34:if(tags.match("沉迷游戏")){setext();}else{next();}break;
			case 35:case 48:if(tags.match("尴尬癌")){setext();}else{next();}break;
			case 40:if(tags.match("残疾")&&!tags.match("睿智")){setext();}else{next();}break;
			case 41:if(tags.match("残疾")&&tags.match("睿智")){setext();}else{next();}break;
			case 42:if(tags.match("太太")||tags.match("新人网红")){setext();}else{next();}break;
			case 43:if(tags.match("渣女")){setext();}else{next();}break;
			case 44:if(tags.match("病弱")){setext();}else{next();}break;
			case 46:if(tags.match("镇室之宝")){setext();}else{next();}break;
			case 47:case 66:if(tags.match("贫穷")){setext();}else{next();}break;
			case 49:if(tags.match("虚弱")){setext();}else{next();}break;
			case 52:if(tags.match("搓衣板")){setext();}else{next();}break;
			case 54:if(tags.match("真混子")){setext();}else{next();}break;
			case 55:if(tags.match("靠谱")){setext();}else{next();}break;
			case 56:if(tags.match("文学大师")){setext();}else{next();}break;
			case 57:if(tags.match("艺术大师")){setext();}else{next();}break;
			case 58:if(tags.match("自闭")&&(tags.match("演讲达人")||tags.match("loser"))){setext();}else{next();}break;
			case 59:if(!tags.match("自闭")&&tags.match("尴尬癌")){setext();}else{next();}break;
			case 60:if(!tags.match("自闭")&&(tags.match("人民公敌")||tags.match("睿智"))){setext();}else{next();}break;
			case 61:if(tags.match("懒惰")){setext();}else{next();}break;
			case 62:if(tags.match("恋虫癖")){seiheki = "恋虫癖";setext();}
				else if(tags.match("恋物癖")){seiheki = "恋物癖";setext();}
				else if(tags.match("真空")){seiheki = "真空";setext();}
				else if(tags.match("妄想症")){seiheki = "妄想症";setext();}
				else{next();}break;
			case 63:if(tags.match("恶毒")){setext();}else{next();}break;
			case 64:if(tags.match("毒舌")||tags.match("糟糕")){setext();}else{next();}break;
			case 65:if((tags.match("毒舌")||tags.match("糟糕"))&&!tags.match("高冷")){setext();}else{next();}break;
			case 67:if(tags.match("见异思迁")){setext();}else{next();}break;
			case 68:case 72:if((tags.match("坠入爱河")||tags.match("沉迷游戏"))&&!tags.match("见异思迁")){setext();}else{next();}break;
			case 69:if(tags.match("宿醉")){setext();}else{next();}break;
			case 73:if(tags.match("贫穷")||tags.match("舔狗")){setext();}else{next();}break;
			case 74:if(tags.match("被人盯上")||tags.match("人民公敌")){setext();}else{next();}break;
			case 75:if(tags.match("自闭")){heki = "自闭";setext();}
				else if(tags.match("社恐")){heki = "社恐";setext();}
				else{next();}break;
			case 76:if(!tags.match("自闭")&&!tags.match("社恐")){setext();}else{next();}break;
			case 79:if(tags.match("闪电侠")){setext();}else{next();}break;
			case 81:if(tags.match("自以为是")&&tags.match("非洲人")){setext();}else{next();}break;
			case 82:if(tags.match("舔狗")){setext();}else{next();}break;
			case 83:if(tags.match("执着")){setext();}else{next();}break;
			case 84:if(!tags.match("舔狗")){setext();}else{next();}break;
			case 86:if(tags.match("医生的关怀")){setext();}else{next();}break;
			case 87:if(tags.match("室友的关怀")){setext();}else{next();}break;
			case 88:if(tags.match("阿姨的关怀")){setext();}else{next();}break;
			case 89:if(tags.match("迷弟的关怀")){setext();}else{next();}break;
			case 91:if(weight<80){
					if(tags.match("执着")){ind = 92;next();}
					else{setext();}
				}else{ind = 98;next();}break;
			
			default:setext();
		}
	}
	window.scrollTo(0,document.body.scrollHeight);
}

function setext(){
	var newdiv = document.createElement("div");
	newdiv.innerHTML = dealstr(evs[ind][1]);
	newdiv.className = "card";
	if((evs[ind][0] != 0)||(evs[ind][5] != "")){newdiv.appendChild(document.createElement("br"));newdiv.appendChild(document.createElement("br"));}
	if(evs[ind][0] != 0){
		var newspan = document.createElement("span");
		if(evs[ind][0]>0){
			if(evs[ind][0]==999){evs[ind][0] = tmpweight;}
			newspan.innerHTML = "体重+" + evs[ind][0];newspan.className = "tag3";}
		else{newspan.innerHTML = "体重" + evs[ind][0];newspan.className = "tag2";}
		newdiv.appendChild(newspan);
		weight += evs[ind][0];document.getElementById("weight").innerHTML = weight;
	}
	if(evs[ind][5] != ""){
		var newspan = document.createElement("span");
		newspan.className = "tag";
		newspan.innerHTML = evs[ind][5];
		newdiv.appendChild(newspan);
		tags += (evs[ind][5]+",");
	}
	document.getElementById("ctn").appendChild(newdiv);
	if(evs[ind][2] != 0){
		setsel(document.getElementById("sel1"),evs[ind][2]);
		setsel(document.getElementById("sel2"),evs[ind][3]);
		setsel(document.getElementById("sel3"),evs[ind][4]);
		document.getElementById("next").style.display = "none";
	}
}
function setsel(sel,i){
	sel.innerHTML = sels[i][1];
	sel.setAttribute("onclick","selme("+i+");");
	sel.style.display = "block";
}

function selme(i){
	document.getElementById("sel1").style.display = "none";
	document.getElementById("sel2").style.display = "none";
	document.getElementById("sel3").style.display = "none";
	switch(i){
		case 13:task = 1;break;
		case 14:task = 2;break;
		case 15:task = 3;break;
		case 16:case 17:case 18:if(Math.random()<0.5){i = 16;task = 3;}else{i = 17;}break;
		case 37:case 38:case 39:if(task==2){i += 3;}break;
	}
	var card = document.getElementById("ctn").lastChild;
	card.innerHTML = dealstr(sels[i][2]);
	if((sels[i][0] != 0)||(sels[i][3] != "")){card.appendChild(document.createElement("br"));card.appendChild(document.createElement("br"));}
	if(sels[i][0] != 0){
		var newspan = document.createElement("span");
		if(sels[i][0]>0){newspan.innerHTML = "体重+" + sels[i][0];newspan.className = "tag3";}
		else{
			if(sels[i][0]==-999){tmpweight = weight;sels[i][0] = -weight;}
			newspan.innerHTML = "体重" + sels[i][0];newspan.className = "tag2";}
		card.appendChild(newspan);
		weight += sels[i][0];document.getElementById("weight").innerHTML = weight;
	}
	if(sels[i][3] != ""){
		var newspan = document.createElement("span");
		newspan.className = "tag";
		newspan.innerHTML = sels[i][3];
		card.appendChild(newspan);
		tags += (sels[i][3]+",");
	}
	document.getElementById("next").style.display = "block";
}

function dealstr(str){
	var tmp = str.replace(/XXX/g,name);
	tmp = tmp.replace("【seiheki】",seiheki);
	tmp = tmp.replace("【heki】",heki);
	return tmp;
}

function checkinp(me){
	if(me.value == ""){document.getElementById("start").className = "main dis";}
	else{document.getElementById("start").className = "main";}
}
function checkname(me){
	var v = document.getElementsByTagName("input")[0].value;
	if((v != "")&&(me.className == "main")){
		if(v.match("刘帅哥")||v.match("文蕊")||v.match("小妹")){alert("滚！！！");}
		else{
			document.getElementsByClassName("card")[0].style.display = "none";
			me.style.display = "none";
			name = v;document.getElementById("name").innerHTML = name;
			document.getElementById("info").style.display = "block";
			next();
		}
	}
}